[
  {
    "joke": "Microsoft has made available a new outeractive smartphone app for bullied jr high school dorks and college geeks. It's called the Chuck Norris app. Push the app icon and a Chuck Norris fist explodes from the smartphone and lands squarely upon the soon to be bloody nose of the nearest bully.",
    "date": "2024-05-23T13:55:43.031Z"
  },
  {
    "joke": "Chuck Norris roundhouse kicked a man in a wheelchair in the ground people dug that fossil up it is now a handicap parking sign but really it is a warning that Chuck is coming",
    "date": "2024-05-23T13:55:44.382Z"
  },
  {
    "joke": "Chuck Norris can give both men and women boners",
    "date": "2024-05-23T13:55:45.261Z"
  },
  {
    "joke": "Chuck Norris isn't hung like a horse, a horse is hung like Chuck Norris. And Chuck Norris's horse is hung like a blue whale.",
    "date": "2024-05-23T13:55:46.217Z"
  },
  {
    "joke": "Chuck Norris doesn't get constipated, he holds his shit for ransom",
    "date": "2024-05-23T13:55:46.716Z"
  },
  {
    "joke": "Chuck Norris puts the FUN in Funeral.",
    "date": "2024-05-23T13:55:47.032Z"
  },
  {
    "joke": "Chuck Norris drinks bear milk.",
    "date": "2024-05-23T13:55:47.304Z"
  },
  {
    "joke": "Facebook was originally Chuck Norris's personal webpage of pictures of the people he has roundhouse kicked in face.It filled up with so many people it leaked onto the internet.",
    "date": "2024-05-23T13:55:47.547Z"
  },
  {
    "joke": "Chuck Norris can floor a millipede.",
    "date": "2024-05-23T13:55:47.798Z"
  },
  {
    "joke": "One time in school, I forgot to prepare a graded presentation, so I just stood in front of the class and said \"Chuck Norris\". I got an 'A'.",
    "date": "2024-05-23T13:55:48.029Z"
  },
  {
    "joke": "Chuck Norris once squeezed a m&m so hard that it became a skittle.",
    "date": "2024-05-23T13:56:04.211Z"
  },
  {
    "joke": "Alls well that ends well. But if your life ends with a Chuck Norris roundhouse kick, all is not well.",
    "date": "2024-05-23T13:56:07.968Z"
  },
  {
    "joke": "In \"Way of the Dragon\",Bruce Lee bribed Chuck Norris to let him live.",
    "date": "2024-05-23T13:56:17.717Z"
  },
  {
    "joke": "When the sun goes outside,he puts on Chuck Norris glasses.",
    "date": "2024-05-23T13:56:26.248Z"
  },
  {
    "joke": "At exactly April 8 of 2008, at 11:45 and 20 seconds, Chuck Norris stomped his foot. At exactly April 8 of 2001, at 11:45 and 21 seconds, in the closest city to the area exactly 6734 kilometers east away from where Chuck Norris stomped his foot the second earlier, there was a major earthquake.",
    "date": "2024-05-23T13:57:54.755Z"
  },
  {
    "joke": "Chuck Norris beat God in an arm-wrestle......with his feet.",
    "date": "2024-05-23T13:58:21.246Z"
  },
  {
    "joke": "Chuck Norris invented winning.",
    "date": "2024-05-23T13:58:22.046Z"
  },
  {
    "joke": "Chuck Norris can roll a stone and make it gather moss",
    "date": "2024-05-23T13:58:22.701Z"
  }
]